Dlubal.RFEM5.IOpening
Interface for working with opening

Dlubal.RFEM5.IOpening.GetData
Gets opening parameters.
Returns: Opening parameters

Dlubal.RFEM5.IOpening.SetData(System.UInt32@)
Sets opening parameters.
Opening: Opening parameters

Dlubal.RFEM5.IOpening.Delete
Deletes opening including all boundary lines.

Dlubal.RFEM5.IOpening.DeleteWithLines
Deletes opening without losing boundary lines.